<a href="https://colab.research.google.com/github/gloriyathomas/datasets/blob/master/TITANIC_Survival_Prediction_Gloria_Thomas_Very_First_Kaggle.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [31]:
# Kaggle Titanic Survival Prediction

In [32]:
import os
os.environ['KAGGLE_CONFIG_DIR'] = '/content/drive/MyDrive/Kaggle Session Colab'

In [33]:
%cd /content/drive/MyDrive/Kaggle Session Colab

/content/drive/MyDrive/Kaggle Session Colab

In [34]:
!kaggle competitions download -c titanic

Warning: Looks like you're using an outdated API Version, please consider updating (server 1.5.12 / client 1.5.4)
test.csv: Skipping, found more recently modified local copy (use --force to force download)
train.csv: Skipping, found more recently modified local copy (use --force to force download)
gender_submission.csv: Skipping, found more recently modified local copy (use --force to force download)

In [35]:
import pandas as pd
df=pd.read_csv('/content/drive/MyDrive/Kaggle Session Colab/train.csv')
df.head()
df.isnull().mean()*100

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [36]:
df.drop(['Cabin','PassengerId','Name','Ticket'],1,inplace=True)
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [37]:
df.Age.median()
df.Age=df.Age.fillna(df.Age.median())

In [38]:
df.isnull().mean()*100

Survived    0.000000
Pclass      0.000000
Sex         0.000000
Age         0.000000
SibSp       0.000000
Parch       0.000000
Fare        0.000000
Embarked    0.224467
dtype: float64

In [39]:
df.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [40]:
df.Embarked=df.Embarked.fillna(df.Embarked.mode()[0])

In [41]:
df.Sex.replace(['male','female'],[1,0],inplace=True)

In [42]:
df.Embarked.replace(['S','C','Q'],[1,0,2],inplace=True)

In [43]:
df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         1
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         1
3         1       1    0  35.0      1      0  53.1000         1
4         0       3    1  35.0      0      0   8.0500         1

In [44]:
X=df.drop('Survived',1)
y=df['Survived']

This is just a demo problem as a first Kaggle submission. Hence I have just created the simplest model that's the reason I am not following any standard steps.
- No dummy creation for categorical data
- Not splitting the data into train and test
- No scaling
- No iterations

In [45]:
from sklearn.linear_model import LogisticRegression

from sklearn import metrics

logreg = LogisticRegression()

logreg.fit(X,y)

y_pred = logreg.predict(X)

print("Recall: ", metrics.recall_score(y, y_pred))

Recall:  0.7105263157894737

/usr/local/lib/python3.7/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

In [46]:
test=pd.read_csv('/content/drive/MyDrive/Kaggle Session Colab/test.csv')
test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [47]:
test_copy=test.copy()

In [48]:
test.drop(['Cabin','PassengerId','Name','Ticket'],1,inplace=True)
test.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

In [49]:
test.isnull().mean()*100

Pclass       0.000000
Sex          0.000000
Age         20.574163
SibSp        0.000000
Parch        0.000000
Fare         0.239234
Embarked     0.000000
dtype: float64

In [50]:
test.Age.fillna(test.Age.median(),inplace=True)

In [51]:
test.Fare.fillna(test.Fare.median(),inplace=True)

In [52]:
test.Embarked.replace(['S','C','Q'],[1,0,2],inplace=True)

In [53]:
test.Sex.replace(['male','female'],[1,0],inplace=True)

In [54]:
test.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  34.5      0      0   7.8292         2
1       3    0  47.0      1      0   7.0000         1
2       2    1  62.0      0      0   9.6875         2
3       3    1  27.0      0      0   8.6625         1
4       3    0  22.0      1      1  12.2875         1

In [55]:
X.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  22.0      1      0   7.2500         1
1       1    0  38.0      1      0  71.2833         0
2       3    0  26.0      0      0   7.9250         1
3       1    0  35.0      1      0  53.1000         1
4       3    1  35.0      0      0   8.0500         1

In [56]:
pred=logreg.predict(test)

In [57]:
test_copy['Survived']=pred

In [58]:
test_copy.head()

   PassengerId  Pclass  ... Embarked Survived
0          892       3  ...        Q        0
1          893       3  ...        S        0
2          894       2  ...        Q        0
3          895       3  ...        S        0
4          896       3  ...        S        1

[5 rows x 12 columns]

In [59]:
submit=test_copy[['PassengerId','Survived']]
submit.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [60]:
submit.to_csv('submit.csv', index = False)

THANK YOU